[
    "Dance for 1 minute without music.",
    "Let someone write a word on your forehead with a marker.",
    "Sing the chorus of your favorite song.",
    "Do 20 pushups.",
    "Speak in an accent for the next 3 rounds.",
    "Try to lick your elbow.",
    "Post an embarrassing photo on social media.",
    "Imitate a celebrity until someone can guess who you are.",
    "Do your best chicken dance outside on the lawn.",
    "Let someone tickle you for 30 seconds.",
    "Talk in a funny voice for the next 5 minutes.",
    "Act like a monkey until your next turn.",
    "Do an impression of your favorite celebrity.",
    "Wear socks on your hands for the next 10 minutes.",
    "Dance with no music for 2 minutes.",
    "Do your best impression of a baby being born.",
    "Do your best impression of someone from the group.",
    "Do 20 jumping jacks.",
    "Let the person to your left draw on your face with a pen.",
    "Speak in a different accent until your next turn.",
    "Pretend to be a waiter/waitress and take snack orders from everyone in the group.",
    "Attempt to do a magic trick.",
    "Do your best breakdance move.",
    "Pretend to be a chicken for 1 minute.",
    "Let someone in the group give you a new hairstyle.",
    "Imitate a cartoon character.",
    "Do an impression of a celebrity of the group’s choosing.",
    "Try to juggle 3 items (none of which can be balls).",
    "Act like your favorite animal until your next turn.",
    "Pretend you are a ballerina until your next turn.",
    "Make a funny face and keep it that way until the next round.",
    "Try to touch your nose with your tongue.",
    "Let the group choose an item for you to brush your teeth with.",
    "Act like an animal of the group's choosing.",
    "Make up a short poem and recite it aloud.",
    "Eat a slice of lemon without making a face.",
    "Sing any song using only sounds, no words.",
    "Attempt to breakdance.",
    "Come up with a funny nickname for each participant.",
    "Speak in a made-up language for a minute.",
    "Act out a scene from any movie without using words, and let others guess.",
    "Draw something on paper while holding the pencil in your mouth.",
    "Swap one item of clothing with any participant.",
    "Read any message on your phone aloud, but in reverse order.",
    "Create a ridiculous sentence using three random words chosen by the group.",
    "Hop on one foot while patting your head and rubbing your stomach for 30 seconds.",
    "Pretend to be a statue until your next turn.",
    "Make up a song about what you're doing right now and sing it.",
    "Speak in rhymes until your next turn.",
    "Do your best impression of a robot.",
    "Pretend to be a superhero of the group's choosing for the next 5 minutes.",
    "Talk like a pirate for the next 3 minutes.",
    "Do a silly dance and stop only when the group tells you to.",
    "Pretend you're underwater for the next 2 minutes.",
    "Speak in a whisper for the next 5 minutes.",
    "Try to balance a book on your head for 1 minute.",
    "Mime brushing your teeth and washing your face without any props.",
    "Pretend you're a famous chef and describe how to cook your favorite dish.",
    "Act like a penguin until your next turn.",  
    "Do a cartwheel.",  
    "Imitate a baby crying for 30 seconds.",  
    "Talk like a robot until your next turn.",  
    "Do your best impersonation of a dog barking.",  
    "Speak in only questions for the next 5 minutes.",  
    "Pretend you're a waiter/waitress and take drink orders from everyone.",  
    "Do a dramatic reading of a cereal box.",  
    "Try to touch your toes with your nose.",  
    "Do your best impression of a famous singer.",  
    "Walk like a zombie for the next minute.",  
    "Try to juggle three items (none of which are balls).",  
    "Try to walk across the room while blindfolded.",  
    "Do 30 seconds of high knees.",  
    "Do your best impersonation of an old person.",  
    "Do 10 squats.",  
    "Speak in gibberish for the next 3 rounds.",  
    "Do a dramatic reenactment of your favorite scene from a movie.",  
    "Try to whistle a song of your choice.",  
    "Act like a robot for the next 3 minutes.",  
    "Try to do a cartwheel with your eyes closed.",  
    "Walk backwards for the next 2 minutes.",  
    "Pretend to be a ballerina for 1 minute.",  
    "Do your best impersonation of a famous movie villain.",  
    "Hop on one foot for 1 minute.",  
    "Talk like a baby for the next 3 minutes.",  
    "Make an animal sound for the next 2 minutes.",  
    "Do a silly dance and don't stop until someone else joins you.",  
    "Create a funny handshake with someone else.",  
    "Do 20 jumping jacks and shout out something random every time you land.",  
    "Do an impression of your favorite cartoon character.",  
    "Act like you’re underwater for the next 2 minutes.",  
    "Let someone else draw a funny face on your cheek with a pen.",  
    "Do an impression of your favorite celebrity and don't stop until someone guesses who it is.",  
    "Talk like a pirate until your next turn.",  
    "Create a funny song about your favorite food and sing it loudly.",  
    "Imitate a famous athlete’s walk or run for 1 minute.",  
    "Do an impression of someone from the group.",  
    "Try to talk without using the letter ‘E’ for the next 5 minutes.",  
    "Do 10 push-ups while holding a silly face.",  
    "Walk like you’re on a runway for 2 minutes.",  
    "Imitate an animal of your choice for the next 3 minutes.",  
    "Act like a tree in the wind for 1 minute.",  
    "Try to make your voice sound like a different instrument for the next 3 minutes.",  
    "Do a handstand (or try!).",  
    "Draw a mustache on your face with a marker.",  
    "Do an impression of a famous singer singing a Christmas song.",  
    "Talk like you're in a movie trailer for the next 2 minutes.",  
    "Do 10 sit-ups while singing a song of your choice.",  
    "Do your best impersonation of a historical figure.",  
    "Do 20 squats while shouting your favorite color.",  
    "Sing a song like you're underwater.",  
    "Try to balance something on your head for 1 minute.",  
    "Create a dance routine to your favorite song and perform it.",  
    "Pretend you're a detective and describe the crime scene to everyone.",  
    "Do a somersault.",  
    "Imitate a famous scientist for 1 minute.",  
    "Do your best impersonation of a chicken.",  
    "Try to mimic a foreign accent for the next 3 minutes.",  
    "Walk with a limp for the next 2 minutes.",  
    "Do an impression of a person in the room for the next 3 minutes.",  
    "Talk like you’re a character from a 1920s silent movie.",  
    "Do 30 seconds of plank while making animal noises.",  
    "Create a new dance move and teach it to everyone.",  
    "Sing a song as if you were in a musical.",  
    "Talk like you're in a soap opera for the next 3 minutes.",  
    "Pretend you're a famous artist and describe your latest painting.",  
    "Do your best impression of a baby crying and throwing a tantrum.",  
    "Act like you're on a cooking show and explain how to make your favorite dish.",  
    "Do 10 lunges while singing a lullaby.",  
    "Imitate someone’s laugh for the next 2 minutes.",  
    "Do your best impression of a famous chef on a cooking show.",  
    "Try to do a split.",  
    "Hop like a frog for 1 minute.",  
    "Speak like a villain for the next 3 minutes.",  
    "Do your best impression of a famous comedian.",  
    "Try to moonwalk for 1 minute.",  
    "Create a new handshake and teach it to someone.",  
    "Talk like a robot with a malfunction for the next 2 minutes.",  
    "Do your best impersonation of a famous musician.",  
    "Speak in rhymes for the next 5 minutes.",  
    "Do 20 jumping jacks and make a random sound each time you land.",  
    "Try to do a backflip (or attempt!).",  
    "Act like a superhero and save someone from danger.",  
    "Imitate your favorite animal and keep it up for 1 minute.",  
    "Do your best impersonation of a random character from a cartoon.",  
    "Make up a funny dance move and do it for 30 seconds.",  
    "Imitate a famous movie director for the next 3 minutes.",  
    "Try to do a cartwheel while making a silly face.",  
    "Speak in a deep voice for the next 3 minutes.",  
    "Do an impression of a famous TV character.",  
    "Try to sing without opening your mouth.",  
    "Make a funny noise every time you move for the next 5 minutes.",  
    "Do your best impersonation of a famous athlete.",  
    "Do 20 sit-ups and shout out something funny every time you go down.",  
    "Talk like a cowboy for the next 3 minutes.",  
    "Act like a wizard casting spells for the next 5 minutes.",  
    "Try to do a backbend.",  
    "Do your best impersonation of a famous comedian.",  
    "Talk in only emojis for the next 5 minutes.",  
    "Act like you're on a cooking show and describe how to make a snack.",  
    "Try to balance on one leg for 1 minute while singing a song.",  
    "Do your best impersonation of a famous character from a movie.",  
    "Speak in a very slow voice for the next 3 minutes.",  
    "Make a funny face and hold it for 1 minute.",  
    "Do your best impression of someone from the group.",  
    "Try to talk with your mouth full for the next 5 minutes.",  
    "Do your best impersonation of a TV host.",  
    "Sing your favorite song like you're on stage.",  
    "Talk like you're a robot for 2 minutes.",  
    "Do 20 squats and shout a random fact each time you squat.",  
    "Create a silly rap about your day and perform it.",  
    "Do an impression of a cartoon character and act like them for 1 minute.",  
    "Try to touch your toes while standing for 1 minute.",  
    "Imitate a famous politician for the next 3 minutes.",  
    "Try to balance two books on your head for 1 minute.",  
    "Create a funny skit and perform it for everyone.",  
    "Do an impression of a character from a children’s show.",  
    "Speak in rhymes for the next 5 minutes.",  
    "Do your best impersonation of a famous scientist for 1 minute.",  
    "Imitate a famous superhero and act like them for 2 minutes.",  
    "Talk like a cowboy for the next 5 minutes.",  
    "Do your best impersonation of a famous singer performing live.",  
    "Walk like you're on a tightrope for the next 2 minutes.",  
    "Try to say the alphabet backwards.",  
    "Do a silly dance and make it as ridiculous as possible.",  
    "Talk in an alien language for the next 2 minutes.",  
    "Do an impression of a famous animal character.",  
    "Act like a famous movie director giving instructions for the next 3 minutes.",  
    "Do 10 lunges and make a random sound each time you go down.",  
    "Try to make a sandwich using your feet.",  
    "Create a funny voice and speak in it for the next 2 minutes.",  
    "Do your best impression of a famous fashion designer.",  
    "Speak in an old-timey voice for the next 2 minutes.",
    "Imitate a chicken laying an egg for 30 seconds.",  
    "Do your best impersonation of a famous cartoon character for 1 minute.",  
    "Speak like a caveman for the next 2 minutes.",  
    "Create a silly song about the person to your left and perform it.",  
    "Walk like a penguin for 1 minute.",  
    "Do a cartwheel and make a sound every time you land.",  
    "Talk in a robot voice for the next 2 minutes.",  
    "Do your best impression of a cat for 30 seconds.",  
    "Do 20 jumping jacks while singing a song.",  
    "Talk like a king or queen for the next 2 minutes.",  
    "Do 10 push-ups while making animal sounds.",  
    "Make a funny face and hold it for 1 minute.",  
    "Sing a song like you have a sore throat.",  
    "Imitate your favorite animal for 1 minute.",  
    "Try to talk with your mouth full for the next 2 minutes.",  
    "Create a new dance move and teach it to someone.",  
    "Do a dramatic reading of a cereal box.",  
    "Speak in only questions for the next 3 minutes.",  
    "Do an impression of someone famous for 2 minutes.",  
    "Act like a zombie for 1 minute.",  
    "Do your best superhero pose and hold it for 30 seconds.",  
    "Do your best impression of a baby crying.",  
    "Hop on one foot for 1 minute while singing a song.",  
    "Try to balance a spoon on your nose for 1 minute.",  
    "Imitate a famous athlete's walk for 1 minute.",  
    "Create a funny handshake with the person next to you.",  
    "Do 10 sit-ups while singing a song.",  
    "Walk like you're on a tightrope for 1 minute.",  
    "Talk in only rhymes for the next 3 minutes.",  
    "Do your best impression of a TV show host.",  
    "Talk like a pirate for the next 2 minutes.",  
    "Act like a superhero for the next 3 minutes.",  
    "Do an impression of a famous singer performing live.",  
    "Speak in an alien language for 1 minute.",  
    "Do 20 push-ups and shout out something random each time you go down.",  
    "Create a funny nickname for everyone in the room.",  
    "Do your best impression of a famous movie character.",  
    "Talk in a high-pitched voice for the next 2 minutes.",  
    "Try to touch your toes while standing for 1 minute.",  
    "Walk backward for 1 minute.",  
    "Do 20 squats and shout a random word every time you go down.",  
    "Create a funny skit and perform it for everyone.",  
    "Do an impression of a famous historical figure for 2 minutes.",  
    "Try to juggle three items (none of which are balls).",  
    "Do 10 jumping jacks and make a funny face each time you land.",  
    "Talk like you’re underwater for the next 2 minutes.",  
    "Do your best impression of a baby laughing.",  
    "Create a ridiculous dance and teach it to the group.",  
    "Do a silly dance and don’t stop until someone joins you.",  
    "Speak like a robot with a malfunction for 1 minute.",  
    "Do 10 lunges and make a random sound each time you go down.",  
    "Walk like a penguin for 2 minutes.",  
    "Talk like a caveman for the next 3 minutes.",  
    "Make a funny face and hold it for 30 seconds.",  
    "Do your best impersonation of a famous politician for 1 minute.",  
    "Talk like a teacher giving a lesson for 3 minutes.",  
    "Do a dramatic reenactment of your last birthday.",  
    "Imitate a famous chef and describe how to cook your favorite meal.",  
    "Do 20 jumping jacks while making animal sounds.",  
    "Create a funny song about the group and perform it.",  
    "Talk like a robot for the next 5 minutes.",  
    "Do your best impersonation of a famous athlete for 1 minute.",  
    "Act like a famous movie director and give instructions for 1 minute.",  
    "Try to make a sandwich with your feet.",  
    "Do an impression of a famous superhero for 1 minute.",  
    "Sing your favorite song while dancing like a chicken.",  
    "Talk like a king for the next 2 minutes.",  
    "Imitate a famous singer while singing your favorite song.",  
    "Try to do a backflip.",  
    "Do your best impersonation of a historical figure for 2 minutes.",  
    "Create a dance routine and teach it to the group.",  
    "Do a handstand for 30 seconds.",  
    "Act like an animal of your choice for 2 minutes.",  
    "Create a new dance move and teach it to everyone.",  
    "Do 10 sit-ups while singing a lullaby.",  
    "Try to make your voice sound like an instrument.",  
    "Imitate a famous movie villain for 1 minute.",  
    "Try to juggle three items (non-balls).",  
    "Do an impression of a famous TV character for 2 minutes.",  
    "Talk like a scientist for 1 minute.",  
    "Do your best impersonation of a famous comedian for 1 minute.",  
    "Act like you're in a soap opera for 2 minutes.",  
    "Try to walk across the room with your eyes closed.",  
    "Imitate a famous athlete for 1 minute.",  
    "Speak in a high-pitched voice for 2 minutes.",  
    "Do 20 push-ups while singing your favorite song.",  
    "Walk like a ballerina for 1 minute.",  
    "Try to balance something on your head for 1 minute.",  
    "Do an impression of a baby being born.",  
    "Create a new handshake with the person to your right.",  
    "Talk like you’re a robot that’s malfunctioning for 2 minutes.",  
    "Do your best impression of a TV character for 1 minute.",  
    "Try to say the alphabet backwards.",  
    "Act like a tree in the wind for 2 minutes.",  
    "Create a funny skit and perform it for everyone.",  
    "Talk like a pirate for 1 minute.",  
    "Do 20 sit-ups while making random animal noises.",  
    "Do an impression of someone famous for 1 minute.",  
    "Walk like a zombie for 2 minutes.",  
    "Do a silly dance and keep going until someone joins you.",  
    "Talk like you're in a movie trailer for the next 3 minutes.",  
    "Do 10 push-ups while making animal noises each time you go down.",  
    "Do your best impression of a famous politician for 1 minute.",  
    "Create a funny song about your day and sing it.",  
    "Try to make a sandwich with your feet.",  
    "Act like you’re underwater for 1 minute.",  
    "Create a new dance and teach it to the group.",  
    "Do your best impersonation of a baby crying.",  
    "Walk like a penguin for 1 minute.",  
    "Try to talk in rhymes for the next 3 minutes.",  
    "Do 20 jumping jacks and make a funny noise each time you land.",  
    "Do an impression of a famous superhero for 1 minute.",  
    "Talk like a caveman for the next 2 minutes.",  
    "Do your best impression of a famous singer while dancing.",  
    "Create a new voice and speak in it for the next 5 minutes.",  
    "Talk like a pirate for the next 2 minutes.",  
    "Try to balance a spoon on your nose for 2 minutes.",  
    "Create a funny nickname for the person to your right.",  
    "Act like a famous movie villain for 1 minute.",  
    "Do your best impersonation of a famous athlete for 1 minute.",  
    "Speak like a robot for the next 2 minutes.",  
    "Do your best impersonation of a cartoon character for 1 minute.",
    "Do an impression of a cat purring for 1 minute.",  
    "Try to sing a song while holding your nose.",  
    "Do 20 push-ups while shouting out random words.",  
    "Act like a zombie for the next 2 minutes.",  
    "Do your best impression of a baby laughing.",  
    "Talk like a pirate for the next 5 minutes.",  
    "Do your best robot dance.",  
    "Speak like you’re in a cartoon for the next 2 minutes.",  
    "Do 10 jumping jacks while singing a song.",  
    "Do your best impersonation of a famous celebrity for 1 minute.",  
    "Hop on one foot for 1 minute while singing a song.",  
    "Talk like a professor for the next 3 minutes.",  
    "Do your best impression of a superhero for 1 minute.",  
    "Try to juggle 3 items (non-balls).",  
    "Walk like a penguin for 2 minutes.",  
    "Do 20 squats while saying random animal sounds.",  
    "Do an impression of a famous TV character for 2 minutes.",  
    "Speak in a low voice for the next 3 minutes.",  
    "Imitate a baby crying for 1 minute.",  
    "Walk like a ballerina for 2 minutes.",  
    "Create a funny song about your favorite food and sing it.",  
    "Do an impression of a robot for 1 minute.",  
    "Make a funny face and keep it that way for 2 minutes.",  
    "Do 10 sit-ups while singing your favorite song.",  
    "Act like a famous historical figure for 1 minute.",  
    "Talk like a secret agent for the next 2 minutes.",  
    "Do an impression of a cartoon character for 1 minute.",  
    "Create a funny skit and perform it for everyone.",  
    "Talk in a southern accent for the next 3 minutes.",  
    "Do your best impersonation of a famous singer for 1 minute.",  
    "Speak like a king for the next 3 minutes.",  
    "Try to balance something on your head for 2 minutes.",  
    "Act like an animal of the group's choosing for the next 2 minutes.",  
    "Do a funny dance and make animal noises while doing it.",  
    "Try to do a cartwheel.",  
    "Speak in a robot voice for the next 3 minutes.",  
    "Do 10 lunges while making silly noises each time you go down.",  
    "Imitate a famous chef and describe how to cook your favorite meal.",  
    "Walk like you’re on a tightrope for 2 minutes.",  
    "Speak in only questions for the next 3 minutes.",  
    "Do 20 push-ups while making random sounds.",  
    "Try to do a backflip.",  
    "Speak like a villain from a movie for the next 2 minutes.",  
    "Create a new dance move and teach it to everyone.",  
    "Talk like a news anchor for the next 2 minutes.",  
    "Do 10 sit-ups while singing a lullaby.",  
    "Act like a monkey for 1 minute.",  
    "Speak like a caveman for the next 3 minutes.",  
    "Walk like a zombie for 2 minutes.",  
    "Create a funny nickname for someone in the group.",  
    "Do 20 squats while singing a song.",  
    "Imitate a famous singer while dancing.",  
    "Talk like a teacher giving a lecture for the next 3 minutes.",  
    "Do your best impersonation of a famous movie character.",  
    "Create a new handshake with the person to your left.",  
    "Speak in a high-pitched voice for the next 2 minutes.",  
    "Do your best impression of a famous TV host.",  
    "Make a funny face and hold it for 1 minute.",  
    "Do an impression of a famous comedian for 1 minute.",  
    "Act like a famous historical figure for the next 3 minutes.",  
    "Create a funny skit and perform it for everyone.",  
    "Do your best impersonation of a famous villain for 2 minutes.",  
    "Speak in a deep voice for the next 2 minutes.",  
    "Try to make a sandwich with your feet.",  
    "Talk like you’re underwater for the next 3 minutes.",  
    "Do 20 jumping jacks while making funny noises.",  
    "Do your best impression of a famous movie director for 1 minute.",  
    "Act like a famous movie hero for 2 minutes.",  
    "Do an impression of a famous character for 1 minute.",  
    "Talk like a pirate for the next 5 minutes.",  
    "Do your best impression of a famous athlete for 2 minutes.",  
    "Speak like you’re in a soap opera for the next 2 minutes.",  
    "Try to balance a book on your head for 1 minute.",  
    "Do a dramatic reading of your favorite book.",  
    "Walk like a ballerina for 1 minute.",  
    "Talk like a professor for the next 3 minutes.",  
    "Act like a chicken for 1 minute.",  
    "Do an impression of a famous movie villain for 2 minutes.",  
    "Speak like a robot for the next 2 minutes.",  
    "Do your best impression of a famous singer for 1 minute.",  
    "Talk like a king for the next 3 minutes.",  
    "Do 10 jumping jacks while holding your breath.",  
    "Create a funny song about your favorite hobby.",  
    "Imitate a famous cartoon character for 1 minute.",  
    "Act like a superhero for 1 minute.",  
    "Do 20 sit-ups while making animal noises.",  
    "Talk like a movie star for the next 3 minutes.",  
    "Do an impression of a famous TV character for 2 minutes.",  
    "Create a silly dance and perform it for the group.",  
    "Do your best impression of a historical figure for 1 minute.",  
    "Try to say the alphabet backwards.",  
    "Speak like you’re in a game show for the next 3 minutes.",  
    "Do your best impression of a famous athlete.",  
    "Try to make a sandwich using your feet.",  
    "Walk like a penguin for 1 minute.",  
    "Talk like a caveman for the next 2 minutes.",  
    "Do an impression of a famous superhero for 1 minute.",  
    "Do 10 push-ups while making random animal sounds.",  
    "Create a new dance and teach it to the group.",  
    "Talk like a professor for the next 2 minutes.",  
    "Walk like a ballerina for 1 minute.",  
    "Do 20 squats while singing a song.",  
    "Talk like a secret agent for the next 2 minutes.",  
    "Do your best robot impression for 1 minute.",  
    "Create a funny nickname for everyone in the group.",  
    "Imitate a famous singer for 1 minute.",  
    "Talk like a pirate for the next 3 minutes.",  
    "Do 10 jumping jacks while making animal sounds.",  
    "Do your best impression of a famous athlete for 1 minute.",  
    "Create a funny skit and perform it for everyone.",  
    "Speak in a high-pitched voice for the next 2 minutes."
]   
