[
    "What is your biggest fear?",
    "What is the most embarrassing thing you've ever done?",
    "Have you ever lied to get out of trouble?",
    "What is your biggest regret?",
    "What is your secret talent?",
    "Have you ever had a crush on someone in this room?",
    "What is the worst gift you have ever received?",
    "What is the most childish thing you still do?",
    "Have you ever cheated on a test?",
    "What is the strangest dream you've ever had?",
    "If you could change one thing about your past, what would it be?",
    "Who is your secret crush?",
    "What is the most annoying habit you have?",
    "What is the worst lie you’ve ever told?",
    "What is something you have never told anyone?",
    "Who was your first kiss?",
    "What is the most embarrassing thing your parents have caught you doing?",
    "What is the biggest misconception about you?",
    "What is the most awkward date you have been on?",
    "Have you ever been in love?",
    "What is the weirdest thing you have ever done in public?",
    "What is your guilty pleasure?",
    "Have you ever stolen something?",
    "What is the most trouble you have been in?",
    "What is the weirdest food you have ever eaten?",
    "What is your biggest pet peeve?",
    "What is your biggest insecurity?",
    "What is the meanest thing you have ever said to someone?",
    "What is the most ridiculous thing you have done because you were bored?",
    "What is the best prank you have ever pulled?",
    "What is your most bizarre talent?",
    "Have you ever broken a bone?",
    "What is the most embarrassing song you secretly love?",
    "If you could swap lives with someone for a day, who would it be?",
    "What is the most embarrassing nickname you've ever had?",
    "Have you ever pretended to be sick to get out of something?",
    "What is the most ridiculous fear you have?",
    "Have you ever had a wardrobe malfunction in public?",
    "What is the worst date you’ve ever been on?",
    "Have you ever been caught talking to yourself?",
    "What is the most embarrassing thing you've done while drunk?",
    "What is the weirdest thing you've ever done alone?",
    "What is the strangest thing you've ever bought?",
    "Have you ever laughed at a time when it was inappropriate?",
    "What is your most embarrassing moment at school?",
    "What is the weirdest rumor you've heard about yourself?",
    "Have you ever pretended to like a gift you didn’t actually like?",
    "What is the most awkward conversation you've ever had?",
    "Have you ever been caught sneaking out?",
    "What is the strangest compliment you’ve ever received?",
    "What is the worst advice you've ever given?",
    "What is the most bizarre thing you've ever eaten?",
    "What is the most embarrassing thing you've done for love?",
    "What is the biggest risk you've ever taken?",
    "What is the dumbest lie you've ever told?",
    "What is the most uncomfortable thing you've ever worn?",
    "What is the strangest superstition you believe in?",
    "What is the most embarrassing thing you've searched for online?",
    "Have you ever had a paranormal experience?",
    "What is the weirdest place you've ever fallen asleep?",
    "What is the most unusual item you carry with you?",
    "Have you ever had a crush on a fictional character?",
    "What is the most embarrassing text you've sent to the wrong person?",
    "What is the most bizarre outfit you've ever worn?",
    "What is the most ridiculous thing you’ve done to impress someone?",
    "Have you ever walked into something because you weren’t paying attention?",
    "What is the strangest habit you have?",
    "What is the most awkward thing you've said to a crush?",
    "Have you ever tried to talk your way out of a ticket?",
    "What is the weirdest thing you’ve done with a group of friends?",
    "Have you ever had a dream about someone you know and felt weird about it later?",
    "What is the most embarrassing thing you've done on social media?",
    "Have you ever accidentally sent a text or email to the wrong person?",
    "What is the most unusual thing you've done in a car?",
    "Have you ever tripped and fallen in public?",
    "What is the most ridiculous thing you've argued about?",
    "What is the worst job you’ve ever had?",
    "What is the most embarrassing thing you've done in front of a crowd?",
    "Have you ever forgotten someone’s name right after being introduced?",
    "What is the most awkward thing you've had to explain to someone?",
    "What is the most unusual thing you’ve had to eat because it was the only option?",
    "What is the strangest conversation you’ve ever overheard?",
    "Have you ever told someone you loved their outfit when you really didn’t?",
    "What is the most embarrassing ringtone you've ever had?",
    "What is the weirdest thing you've done to pass the time?",
    "Have you ever had an embarrassing moment in a bathroom?",
    "What is the most awkward family gathering you’ve ever been to?",
    "What is the most unusual thing you’ve collected?",
    "Have you ever given someone a really bad haircut?",
    "What is the most embarrassing typo you've ever made?",
    "Have you ever worn mismatched shoes or socks on purpose?",
    "What is the most awkward text conversation you've had?",
    "What is the weirdest reason you've missed school or work?",
    "What is the most embarrassing thing that has happened to you on a date?",
    "What is the strangest thing you've ever found?",
    "Have you ever lied about your age?",
    "What is the most ridiculous goal you've set for yourself?",
    "Have you ever done something silly just to fit in?",
    "What is the most embarrassing fashion choice you've ever made?",
    "Have you ever blamed someone else for something you did?",
    "What is the weirdest compliment you've given or received?",
    "What is the most unusual thing you've seen someone do in public?",
    "Have you ever accidentally called someone by the wrong name?",
    "What is the most awkward mistake you've made at work or school?",
    "Have you ever worn something inside out all day without realizing it?",
    "What is the most unusual gift you've ever received?",
    "What is the strangest thing you've ever done for money?",
    "Have you ever been caught singing or dancing when you thought you were alone?",
    "What is the most embarrassing thing you've done on a dare?",
    "Have you ever had an awkward misunderstanding with a stranger?",
    "What is the most bizarre thing you've believed as a child?",
    "Have you ever tried to learn a skill and failed miserably?",
    "What is the most awkward situation you've ever been in?",
    "What is the most ridiculous thing you've ever spent money on?",
    "Have you ever had an awkward moment with a celebrity?",
    "What is the weirdest habit someone else has that you find strange?",
    "What is the most awkward text you've sent by mistake?",
    "Have you ever gotten lost in a place you thought you knew well?",
    "What is the most embarrassing thing that happened to you in school?",
    "What is the most unusual hobby you’ve tried?",
    "Have you ever told a lie and immediately regretted it?",
    "What is the most awkward encounter you've had with a neighbor?",
    "What is the strangest thing you've done during a power outage?",
    "Have you ever been caught daydreaming in a serious situation?",
    "What is the most embarrassing thing you've done while trying to look cool?",
    "Have you ever pretended to know something when you really didn't?",
    "What is the weirdest thing you've ever overheard?",
    "Have you ever accidentally worn something backward or inside out?",
    "What is the most ridiculous excuse you've used to get out of something?",
    "Have you ever accidentally locked yourself out of your house or car?",
    "What is the most awkward interaction you've had with a stranger?",
    "Have you ever fallen asleep in an inappropriate place?",
    "What is the strangest superstition you follow?",
    "Have you ever made an embarrassing social media post by mistake?",
    "What is the most embarrassing thing you've done when no one was looking?",
    "Have you ever laughed at a joke you didn’t understand?",
    "What is the weirdest thing you've done on a dare?",
    "Have you ever been caught talking to yourself in public?",
    "What is the most unusual combination of food you've tried?",
    "Have you ever had a crush on a teacher or boss?",
    "What is the most embarrassing thing you've done in a photo?",
    "Have you ever forgotten to do something important and lied about it?",
    "What is the weirdest conversation you've had with a stranger?",
    "Have you ever accidentally said something embarrassing in front of a crowd?",
    "What is the strangest thing you’ve done to avoid doing work?",
    "Have you ever had an embarrassing moment during a family event?",
    "What is the most awkward question you've been asked in public?",
    "Have you ever gotten lost in a store or mall as a child?",
    "What is the most bizarre thing you've done to get someone's attention?",
    "Have you ever had an embarrassing moment with a friend’s family?",
    "What is the strangest thing you've Googled late at night?",
    "Have you ever done something embarrassing thinking no one was watching?",
    "What is the most unusual thing you've had in your pocket?",
        "Have you ever had a wardrobe malfunction in a public place?",
    "What is the most ridiculous thing you've ever done for a dare?",  
    "Have you ever accidentally ruined a surprise for someone?",  
    "What’s the most embarrassing thing you’ve said to a crush?",  
    "What’s the weirdest thing you’ve eaten and liked?",  
    "What’s the most awkward family tradition you have?",  
    "What’s the most embarrassing thing you’ve done at a wedding?",  
    "Have you ever said something completely wrong in front of your boss?",  
    "What’s the most awkward thing you’ve done at a party?",  
    "Have you ever had an embarrassing encounter with a teacher?",  
    "What’s the worst thing you’ve done to impress someone?",  
    "Have you ever sent a text to the wrong person? What did it say?",  
    "What’s the most embarrassing thing you’ve done at work?",  
    "What’s the worst haircut you’ve ever had?",  
    "Have you ever pretended to like a movie just to fit in?",  
    "What’s the most awkward situation you’ve been in at a restaurant?",  
    "What’s the most awkward thing you've done at the gym?",  
    "Have you ever been caught doing something embarrassing on camera?",  
    "What’s the worst advice you’ve ever followed?",  
    "What’s the weirdest thing you’ve done for attention?",  
    "Have you ever laughed in a serious situation?",  
    "Have you ever been caught in the middle of a lie?",  
    "What’s the most embarrassing thing you’ve done at a family gathering?",  
    "What’s the worst fashion mistake you’ve ever made?",  
    "Have you ever been caught talking in your sleep?",  
    "What’s the most awkward thing you’ve done during a video call?",  
    "Have you ever been embarrassed by your own handwriting?",  
    "What’s the weirdest thing you’ve accidentally Googled?",  
    "Have you ever been caught doing something awkward in public?",  
    "What’s the most embarrassing thing you’ve done in front of a crush?",  
    "What’s the most embarrassing thing you’ve done while traveling?",  
    "Have you ever accidentally knocked something over in a store?",  
    "What’s the worst thing you’ve ever said to someone?",  
    "Have you ever tripped over your own feet?",  
    "What’s the most awkward compliment you’ve received?",  
    "Have you ever accidentally spilled food or drink on someone?",  
    "What’s the worst mistake you’ve made while cooking?",  
    "Have you ever tried to flirt and completely failed?",  
    "What’s the worst thing you've done to try to fit in with a group?",  
    "What’s the most ridiculous thing you’ve done because you were bored?",  
    "Have you ever locked yourself out of your house or car?",  
    "What’s the most embarrassing thing you’ve done in front of your parents?",  
    "What’s the most embarrassing thing you’ve done at a concert?",  
    "Have you ever made an embarrassing mistake at work?",  
    "Have you ever been caught talking to yourself out loud?",  
    "What’s the most awkward thing you’ve ever said to a stranger?",  
    "Have you ever sent a text you immediately regretted?",  
    "What’s the most awkward thing you’ve said at a party?",  
    "Have you ever gotten stuck in an elevator?",  
    "Have you ever gotten a song stuck in your head and sang it out loud without realizing it?",  
    "What’s the most embarrassing thing you’ve done at school?",  
    "Have you ever been caught with a ridiculous item in your bag or purse?",  
    "What’s the most ridiculous thing you’ve done to get someone's attention?",  
    "Have you ever accidentally insulted someone without realizing it?",  
    "What’s the most awkward thing you’ve done during a video call?",  
    "Have you ever been embarrassed by your own handwriting?",  
    "What’s the weirdest thing you’ve accidentally Googled?",  
    "Have you ever misheard something completely and embarrassed yourself?",  
    "Have you ever been caught staring at someone awkwardly?",  
    "Have you ever fallen asleep during a conversation?",  
    "What’s the worst thing you’ve ever said during an argument?",  
    "Have you ever tried to impress someone and completely failed?",  
    "What’s the most ridiculous thing you've done to avoid doing work?",  
    "Have you ever had a wardrobe malfunction in public?",  
    "Have you ever eaten something and immediately regretted it?",  
    "Have you ever accidentally broken something expensive?",  
    "What’s the weirdest thing you’ve ever done to pass time?",  
    "What’s the most embarrassing thing you’ve done in a public restroom?",  
    "What’s the most awkward thing you’ve done at a job interview?",  
    "Have you ever been caught talking to someone you thought was your friend but it turned out to be a stranger?",  
    "What’s the most embarrassing thing you’ve done on social media?",  
    "What’s the most embarrassing thing you’ve ever worn to an event?",  
    "Have you ever sent a message to someone you didn't mean to send?",  
    "What’s the most awkward moment you’ve had with a neighbor?",  
    "Have you ever had a crush on someone who didn’t like you back?",  
    "What’s the weirdest rumor you’ve heard about yourself?",  
    "Have you ever walked into a room and completely forgotten why you were there?",  
    "What’s the most embarrassing thing you’ve done in front of your pets?",  
    "Have you ever tried to cover up a mistake and made it worse?",  
    "What’s the most awkward thing you’ve done at a friend's house?",  
    "What’s the most embarrassing thing you’ve done while shopping?",  
    "Have you ever gotten caught in a lie by someone you trust?",  
    "What’s the most ridiculous excuse you've used to skip an event?",  
    "Have you ever done something embarrassing thinking no one was watching?",  
    "What’s the most embarrassing thing you’ve done in an elevator?",  
    "What’s the weirdest thing you’ve ever done to pass time?",  
    "Have you ever had an embarrassing moment while traveling alone?",  
    "What’s the most awkward thing you’ve ever done in an elevator?",  
    "Have you ever tripped over your own feet while talking to someone important?",  
    "What’s the most ridiculous mistake you’ve made while texting?",  
    "Have you ever gotten caught in a lie by someone you trust?",  
    "What’s the most embarrassing thing you’ve done at a party?",  
    "Have you ever been embarrassed by something you said to a stranger?",  
    "What’s the weirdest thing you’ve ever done for attention?",  
    "Have you ever ruined someone else's surprise party by mistake?",  
    "What’s the most awkward thing you’ve said to a coworker?",  
    "Have you ever forgotten to introduce someone properly and made it awkward?",  
    "What’s the most ridiculous thing you've done just to impress someone?",  
    "Have you ever been caught doing something you shouldn't have while at work or school?",
    "What’s the most embarrassing thing you've said to your parents?",  
    "Have you ever accidentally told someone you loved them when you didn’t mean to?",  
    "What's the most ridiculous reason you've ever had for skipping school or work?",  
    "Have you ever tried to act confident and ended up embarrassing yourself?",  
    "What’s the weirdest thing you’ve ever done in public for attention?",  
    "Have you ever had an embarrassing moment while trying to act cool?",  
    "What’s the most awkward conversation you’ve had with a complete stranger?",  
    "Have you ever forgotten someone's name right after meeting them?",  
    "What’s the weirdest thing you've Googled in the middle of the night?",  
    "Have you ever accidentally sent a message to the wrong person and regretted it?",  
    "Have you ever gotten caught in a lie that snowballed into a bigger lie?",  
    "What's the most embarrassing thing you've done in front of a crush?",  
    "Have you ever forgotten to pick up someone at the airport or station?",  
    "What's the most embarrassing mistake you've made while driving?",  
    "Have you ever accidentally spilled food or drink on someone important?",  
    "What's the weirdest outfit you've ever worn in public?",  
    "Have you ever tried to flirt and completely messed up?",  
    "What's the most awkward situation you've been in at a wedding?",  
    "Have you ever walked into a room and completely forgotten what you needed?",  
    "What's the weirdest thing you’ve done to impress someone?",  
    "Have you ever accidentally offended someone without realizing it?",  
    "What's the most awkward thing you've done in front of a group of people?",  
    "Have you ever been caught making a weird noise in public?",  
    "What's the strangest thing you've done to avoid work or school?",  
    "Have you ever tripped and fallen in front of a large group of people?",  
    "What's the most embarrassing thing you've done during a job interview?",  
    "Have you ever worn something inappropriate to a formal event?",  
    "What's the most embarrassing thing you've done in front of a crowd?",  
    "Have you ever gotten lost in a place you thought you knew well?",  
    "What's the weirdest thing you've done on a first date?",  
    "Have you ever accidentally called someone by the wrong name?",  
    "What's the most awkward situation you've been in at a friend's house?",  
    "Have you ever gotten caught daydreaming in a serious situation?",  
    "What's the most ridiculous excuse you've used to get out of something?",  
    "Have you ever spilled a drink on someone by accident?",  
    "What's the most embarrassing thing you've done while trying to look smart?",  
    "Have you ever sent a text to the wrong person and had to awkwardly explain?",  
    "What's the most embarrassing thing you've done at a party?",  
    "Have you ever had a wardrobe malfunction in a public place?",  
    "What's the weirdest thing you’ve done because you were bored?",  
    "Have you ever been caught doing something you thought no one would see?",  
    "What's the most embarrassing thing you’ve done in a grocery store?",  
    "Have you ever had an embarrassing moment with a neighbor?",  
    "What's the most ridiculous thing you've done to get out of an awkward situation?",  
    "Have you ever misheard someone and responded with something completely wrong?",  
    "What's the weirdest rumor you've heard about yourself?",  
    "Have you ever said something awkward to a stranger and then had to walk away?",  
    "What's the most embarrassing thing you've done in a bathroom?",  
    "Have you ever had an embarrassing moment at the gym?",  
    "What's the weirdest thing you’ve done in front of a friend’s family?",  
    "Have you ever had a crush on someone you didn’t even know?",  
    "What's the most embarrassing thing you've done in front of a teacher?",  
    "Have you ever laughed in the middle of a serious situation?",  
    "What's the weirdest conversation you've overheard in public?",  
    "Have you ever accidentally ruined someone’s surprise?",  
    "What's the most awkward thing you've done on social media?",  
    "Have you ever laughed at a joke you didn’t understand?",  
    "What's the weirdest thing you've done to make a good first impression?",  
    "Have you ever told someone you liked something just to fit in?",  
    "What's the most embarrassing thing you've done at a concert?",  
    "Have you ever accidentally made someone feel uncomfortable without realizing it?",  
    "What's the most ridiculous thing you've done while trying to be funny?",  
    "Have you ever gotten caught staring at someone?",  
    "What's the weirdest thing you've done in a group of friends?",  
    "Have you ever tripped while trying to look cool?",  
    "What's the most embarrassing thing you've done while trying to help someone?",  
    "Have you ever spilled food on yourself in public?",  
    "What's the most ridiculous thing you've done because you were nervous?",  
    "Have you ever forgotten to send an important message and had to apologize?",  
    "What's the most awkward text conversation you've ever had?",  
    "Have you ever had a wardrobe malfunction while at a formal event?",  
    "What's the weirdest thing you’ve done because you were tired?",  
    "Have you ever had a really awkward misunderstanding with a friend?",  
    "What's the most embarrassing thing you’ve done at school?",  
    "Have you ever sent a text message and then immediately regretted it?",  
    "What's the most awkward thing you've done in a meeting?",  
    "Have you ever tried to impress someone and completely failed?",  
    "What's the weirdest thing you’ve done to get someone’s attention?",  
    "Have you ever been embarrassed by something you said to your parents?",  
    "What's the most embarrassing thing you've said to a teacher?",  
    "Have you ever walked into something because you weren’t paying attention?",  
    "What's the most awkward situation you've been in with your coworkers?",  
    "Have you ever had a dream about someone and felt weird about it later?",  
    "What's the most awkward thing you've said during a presentation?",  
    "Have you ever gotten caught doing something embarrassing in public?",  
    "What's the most ridiculous thing you've done just to be funny?",  
    "Have you ever walked into a room and forgotten what you wanted to do?",  
    "What's the weirdest thing you've done to impress a crush?",  
    "Have you ever had a moment when you realized you were the center of attention and got embarrassed?",  
    "What's the most embarrassing thing you've done while at a wedding?",  
    "Have you ever tried to make a joke and it completely fell flat?",  
    "What's the most ridiculous thing you’ve done to avoid getting caught doing something?",  
    "Have you ever accidentally offended someone without realizing?",  
    "What's the most awkward thing you've done at a party?",  
    "Have you ever forgotten someone’s name and had to pretend like you remembered?",  
    "What's the most embarrassing thing you've done in a public restroom?",  
    "Have you ever been embarrassed by something your friend did?",  
    "What's the most ridiculous thing you've done while trying to look cool?",  
    "Have you ever tripped over nothing in front of a large crowd?",  
    "What's the weirdest thing you've done to kill time?",  
    "Have you ever had an awkward encounter with a stranger?",  
    "What's the most embarrassing thing you've done to try to impress someone?",  
    "Have you ever gotten caught sneaking into a place you weren’t supposed to be?",  
    "What's the weirdest thing you’ve done to get out of an awkward situation?",  
    "Have you ever made a mistake that ended up making things worse?",  
    "What's the most ridiculous reason you've ever had to lie?",  
    "Have you ever been caught daydreaming in the middle of a conversation?",  
    "What's the most embarrassing thing you've done to avoid doing homework?",  
    "Have you ever tried to impress someone and it went horribly wrong?",  
    "What's the weirdest thing you've ever done because you were nervous?",  
    "Have you ever tripped over your own feet in front of a crowd?",  
    "What's the most embarrassing thing you’ve done in a photo?",  
    "Have you ever forgotten someone’s birthday and had to quickly make it up to them?",  
    "What's the weirdest thing you've done while trying to be polite?",  
    "Have you ever done something embarrassing because you were too tired?",  
    "What's the most awkward mistake you've made while traveling?",  
    "Have you ever gotten caught laughing at something inappropriate?",  
    "What's the most embarrassing thing you've said to someone you didn’t know well?",  
    "Have you ever tried to make small talk and completely failed?",  
    "What's the weirdest thing you've ever done during a meeting?",  
    "Have you ever been embarrassed by something you did without thinking?",  
    "What's the most awkward thing you've done at a family gathering?",  
    "Have you ever tried to make a joke and no one laughed?",  
    "What's the weirdest thing you've done to avoid a conversation?"
]
